# POSTTEST 2

<h6>1. Tampilkan rata-rata, standar deviasi, nilai minimum, nilai maksimum, Q1, Q2, dan Q3 dari attribute bertipe angka.<h6>

In [12]:
import pandas as pd
snap = pd.read_csv("Snapchat_app_store_reviews.csv")
snap = snap.select_dtypes(["float","int"])
snap.describe()

        Unnamed: 0       rating
count  9560.000000  9560.000000
mean   4779.500000     3.127615
std    2759.878621     1.397407
min       0.000000     1.000000
25%    2389.750000     2.000000
50%    4779.500000     3.000000
75%    7169.250000     4.000000
max    9559.000000     5.000000

<h6>2. Tampilkan 10 record pertama dari dataset dengan attribute bertipe angka.<h6>

In [13]:
snap = snap.select_dtypes(["float","int"])
snap.head(10)

   Unnamed: 0  rating
0           0       4
1           1       3
2           2       3
3           3       5
4           4       1
5           5       1
6           6       4
7           7       1
8           8       1
9           9       1

<h6>3. Tampilkan informasi jumlah record, jumlah attribute, nama attribute, jumlah attribute dengan tipe angka. Masukkan informasi tersebut dalam dictionary dengan key sesuai nama informasinya. Tampilkan isi dari dictionary tersebut sebagus mungkin.
<h6>

In [16]:
record, attribute = snap.shape
jml_object = snap.select_dtypes(["float", "int"]).any().sum()
nama_attribute = snap.columns.values
jml_null = snap.isnull().any().sum()

info = {"Jumlah Record": record, 
        "Jumlah Attribute" : attribute, 
        "Nama Attribute" : list(nama_attribute), 
        "Jumlah Object" : jml_object, 
        "Jumlah Nilai Null": jml_null}

for x in info :
    print(x, ":", info[x])

Jumlah Record : 9560
Jumlah Attribute : 2
Nama Attribute : ['Unnamed: 0', 'rating']
Jumlah Object : 2
Jumlah Nilai Null : 0

<h6>4. Tampilkan nilai dataset pada baris dimulai dengan 3 digit NIM akhir hingga data terakhir dan kolom ke 4 hingga kolom terakhir menggunakan ke 2 metode slice.
<h6>

In [38]:
# Menggunakan iloc untuk slicing
metode1 = snap.iloc[121:, 3:]
print(metode1)

# Menggunakan loc untuk slicing
metode2 = snap.index[121:]
metode2 = snap.loc[metode2, 'Kolom_ke-4':]
print(metode2)

Empty DataFrame
Columns: []
Index: [121, 122, 123, 124, 125, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155, 156, 157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 168, 169, 170, 171, 172, 173, 174, 175, 176, 177, 178, 179, 180, 181, 182, 183, 184, 185, 186, 187, 188, 189, 190, 191, 192, 193, 194, 195, 196, 197, 198, 199, 200, 201, 202, 203, 204, 205, 206, 207, 208, 209, 210, 211, 212, 213, 214, 215, 216, 217, 218, 219, 220, ...]

[9439 rows x 0 columns]
      Unnamed: 0  rating
121          121       5
122          122       5
123          123       4
124          124       1
125          125       1
...          ...     ...
9555        9555       1
9556        9556       2
9557        9557       4
9558        9558       4
9559        9559       3

[9439 rows x 2 columns]

<h6>5. Tampilkan jumlah label dari semua attribute yang bernilai object (contoh : Jenis Kelamin, Agama).<h6>

In [40]:
objek = snap.select_dtypes(include=['object'])
jumlah_nilai_unik = objek.nunique()
jumlah_nilai_unik

Series([], dtype: float64)

In [42]:
# Pilih hanya atribut bertipe objek (string)
object_attributes = snap.select_dtypes(include=['object'])

# Hitung jumlah label unik pada setiap kolom objek
unique_labels = object_attributes.nunique()
# Tampilkan hasil dalam bentuk DataFrame
unique_labels_df = pd.DataFrame({'Atribut': unique_labels.index, 'Jumlah Label Unik': unique_labels.values})

print(unique_labels_df)

Empty DataFrame
Columns: [Atribut, Jumlah Label Unik]
Index: []